{"podcast_details": {"podcast_title": "The Intelligence from The Economist", "episode_title": "Too big tech: is Alphabet approaching a growth ceiling?", "episode_image": "https://assets.pippa.io/shows/62e286a934d4d93d6587424a/1689776476419-b4e4678d8a2f9264c3a6b3be36f4eb79.jpeg", "episode_transcript": " Hey, I'm Mark Roberge and this is the Science of Scaling, a podcast about how to scale your revenue and sales. I'm talking with the folks who scaled the most successful sales teams in tech to give us the answers. They Kyle Parrish, the VP of Sales at Figma and Oliver Jay, the CRO at Asana and Kevin Egan, the Head of Sales at Alassian. So subscribe to the show now on Apple podcasts, Spotify, and I guess literally everywhere else you listen to podcasts. Hello and welcome to The Intelligence from The Economist. I'm your host, Aura Ogumbi. Every weekday we provide a fresh perspective on the events shaping your world. You'd be forgiven for thinking that France has had a rather tough year. Strikes and protests dominated news coverage for months and there's an overwhelming sense of discontent. But if you take a look at the economic data, it seems that la vie est belle. And we paid tribute to a man who knew better than most what it means to live at one with nature. But first. In the months after the pandemic, the biggest tech giants faced a difficult time. But quarterly results from Apple and Amazon yesterday suggest that things are improving. Well, slightly anyway. It's still a mixed picture. Amazon's earnings were much better than expected. But growth in Amazon Web Services, which accounts for much of its profits, is slowing. What we're looking for within Amazon, this is a stock that was really sitting out a lot of the rally until this year, had a big catch up move, but still not quite all the way back. I think you set it up. Apple reported a drop in revenues in the second quarter as iPhone sales, which represent nearly half of all revenues, fell by 2.4% year on year. But net profits increased by 2.3%, thanks in part to more subscriptions for its digital services. Last week, Google's owner, Alphabet, reported another set of solid quarterly results. Revenues rose by 7% year on year to $75 billion. The Big Five, Alphabet, Amazon, Apple, Meta and Microsoft, have maintained growth that is exceptional in the entire history of capitalism. But can they sustain that in the long term? So now that all the Big Five tech companies have reported, the picture is one of relative health or indeed, rude health in some cases. Jan Piotrowski is The Economist's business editor. But in fact, if you step back a little bit, this incredible success is becoming a bit of a challenge to future growth. But they're still growing. So what's the problem? Well, the problem is that they have accustomed both their managers and their investors to be growing at stratospheric rates. So take Alphabet, and it's worth focusing on this particular company to show what's happening with all of big tech. Its revenue growth over the period it has been a public company, which is almost 20 years, has been 28% a year on average. Now that means that if it were to sustain that growth, in principle, hypothetically, next year, it would need to add $84 billion extra to its top line, on top of the $300 billion in revenue that it is expected to make this year. If it were hypothetically to add $85 billion next year, that would be more than something like 460 companies in the S&P 500 index made all told in all of last year. That is just remarkable. That is the sort of growth rate that many investors have come to expect. Their problems with maintaining that growth for the tech giants and Alphabet specifically, they have slowed recently. So why has that growth slowed? The main reason is that their core businesses, the businesses that have made them their money, in Alphabet's case, that is digital advertising, are becoming much more mature. So for instance, when digital advertising was only a small fraction of the total advertising budgets of large advertisers, if an industry went through a cyclical downturn, the advertisers could cannibalize a little bit of their non-digital advertising and pour that money instead of on the internet. Now that digital advertising is something like two thirds of all advertising, this cannibalization is becoming much more difficult. The whole digital advertising pie globally is also growing much more slowly from 20, 30% a year to 10% or less, which is forecast in the next few years. So Alphabet's cash cow is becoming much less productive. There is another problem for Alphabet specifically, which is that people are beginning to search differently using platforms like TikTok and Instagram, and they're increasingly using tools like ChatGPT to ask questions about the world. And answering questions is basically the bread and butter of Alphabet's search business. Okay, so I'm glad you mentioned ChatGPT because I was going to ask about that. Would Alphabet turn to these kinds of products to help them usher in new growth? Well, so there are two things here. So one is the technological aspect. It seemed for a while, especially with all the hula-bula over OpenAI and then Microsoft launching a souped up AI version of its Bing search engine in February, it looked like Alphabet had fallen behind technologically. In fact, I just don't think that's necessarily the case. Alphabet has incredible technological chops. It has done a lot of work over many years to implant a lot of AI tools in its existing businesses. And in fact, in the past few months, it has been launching new AI tools left and right, including AI features and things like Gmail and Google Cloud and other nifty little things that do incorporate this new technology. When it comes to its core business, it does have an AI chatbot of its own. It's called Bard. There is a question of how well AI assisted search is actually going to monetize relative to traditional search business. And that is still a little bit unclear. So a lot of investment, but they're not yet putting all their eggs in the AI basket. If you move away from the core business, which is the search advertising business, you can try to generate new revenue and new income by creating all new products or even conjuring up all new novel markets. And Alphabet has since 2015, since it actually rebranded itself as Alphabet from Google, this other division, which it calls Other Bets. And that includes some out there moonshot projects, things like self-driving cars and life extending medicine that it's been working on to try and generate new sources of growth. Life extending medicine, like the kinds of stuff that I used to write about. But last time I checked in, we weren't very optimistic about these moonshot projects. How are they going now? Still not terribly brilliantly. They have been hemorrhaging money. In the past five years, they've made cumulative operating losses on the order of $25 billion on revenues, I think below $4 billion. So not well at all is the short answer. It is very, very difficult, it looks like, to actually create an all new market, which is what, in a way, Google managed to do back when it came up with this very clever way of monetizing its very clever search technology. Are there any bets that seem a bit more promising? Yes. And they're not the sort of out there bets. In fact, Alphabet's possibly biggest wager is somewhat less ambitious. It is a big wager on corporate software and cloud computing. And in fact, the Google Cloud, as the division is called, has now notched up its second straight quarter of profits for the first time after several years of heavy losses when Alphabet was investing a lot in building new data centers. There's potential for growth there. But even here, you have sort of certain limits to growth. So when you look at the existing cloud giants like Amazon Web Services and Microsoft's Azure, their growth has also been slowing. So it is a big bet. It will probably make Alphabet a fair amount of money in the future, but it probably will not manage to sustain its remarkable profit growth over the long term. So Jan, in your view, is there anything left that Alphabet can do to sustain its high growth into the future? I think there's basically one possibility, and it does have to do with computing and artificial intelligence and how it evolves. Mark Andreessen is a famous venture capitalist. He had this line that software is eating the world. And you could sort of ask whether computing is eating the world these days and whether AI is eating the world. And what that means is basically to ask whether computing and artificial intelligence could in effect displace a lot of incumbent business across a vast range of industries. Healthcare, finance, car making, just about anything that you can imagine. Can computing take a big bite out of those existing businesses? And if the answer to that question is yes, then it is big tech companies with deep pockets and incredible technological expertise that might be able to pull that off. That is still a big if, certainly in the short term. Eventually that might happen. The question is, what happens to these companies' growth between now and eventually? And between now and eventually, it is almost invariably going to slow. And indeed, it has been slowing in the past few years. So it will be a very interesting next few years to observe which way big tech will go. And it will tell us a lot about what to expect from this incredibly important industry. Jan, thank you so much for joining us this morning. Thank you, Auré. It was a pleasure. Hey, I'm Mark Robage and this is the Science of Scaling, a podcast about how to scale your revenue and sales. I'm talking with the folks who scaled the most successful sales teams in tech to give us the answers. They're Kyle Parrish, the VP of Sales at Figma and Oliver Jay, the CRO at Asana and Kevin Egan, the Head of Sales at Alassian. So subscribe to the show now on Apple podcasts, Spotify, and I guess literally everywhere else you listen to podcasts. So far this year, the French have done a fine job portraying their country as broken. First, President Emmanuel Macron's decision to raise the retirement age to help the finances of the state pension system led to strikes across the country, including by rubbish collectors. Garbage collectors in Paris have now been on strike for 19 days. As hundreds of rubbish bags build upon the streets, it's becoming the ideal environment for rats to thrive. Then, the fatal shooting by police of a 17-year-old brought revolt on the streets again and several days of violent protest. Rats turned into weapons as protesters launched them at riot police and buildings across France. Mr. Macron heads a minority government that seems to lurch from crisis to crisis. But... Peer behind the attention-grabbing headlines and the scenes of chaos. And it turns out that France is showing surprising vitality. Well, when you dig into things by a number of different measures, France is actually doing quite well if you compare it to its four biggest European neighbours. Sophie Pedder is the Economist's Paris bureau chief. And in a way, one of the biggest mysteries today is that a country with what you could call an aversion to change, a talent for revolt, and even an excessive taste for taxes and rules still manages to get so much right. Like what? What are some of these things that France is getting right? Well, if you take the economy, for example, since 2018, the cumulative growth in GDP in France has been twice that in Germany and ahead of Britain, Italy and Spain. You could look at the number of big companies, for example, in the global top 100, if you measure it by market capitalisation, France has more companies there than any other European country. And even if you look at measures of social welfare, the poverty rate in France is well below the average of its European neighbours. It's a little bit over half America's poverty rate, and it has a much better programme of care and nursery education available for those who are under two years old. So what's enabling all this economic progress? What's the secret source? Well, the fact that France has more companies in the global top 100 is largely due to the luxury goods giants. They have jumped in profitability and in scale in the past decade. French luxury brands last year were more profitable than the big American tech firms. And all three of the world's top luxury firms, that's LVMH, Hermès and Dior, are French. France is home to the biggest bank in the eurozone, that's BNP Paribas. Last year, France registered more patents than the average of its big European neighbours and twice as much as Britain. Even the tech sector is doing really well. Britain and Germany are still home to more of Europe's top 100 unicorns, that is to say the unlisted firms that are valued at over a billion dollars. But the start-up scene in Paris has transformed. Back in 2019, Macron promised that France would produce 25 tech unicorns by 2025. And in fact, that figure was already reached last year. And Sophie, how much of this strong performance can be credited to Emmanuel Macron? But I think the biggest thing that's changed on his watch in many respects is the attitude to business. In the past, France had this reputation for being quite a difficult place to do business with a lot of strikes, a lot of rigid labour laws, relatively high taxes. Now he has brought down those taxes, he has loosened those labour laws. And I think what's really changed is that he sort of sent this message out saying France is open to business and every year he hosts this summit called Choose France. And it's really become a kind of sought-after invitation by some of the big corporate leaders in America and elsewhere. But I think there's another change going on too. And that is that state interventionism, which has got a long history in France, reaching way back to Louis Catole's, his finance minister, Jean-Baptiste Colbert, has become newly fashionable. I mean, it's become a part of the thinking in government in the US, it's become part of policy in the UK, and it's become part of the way that Europe is thinking as well. In fact, the EU is now less strict about allowing public subsidies by national governments. And that has allowed, in a sense, France to sort of indulge its inner core instinct. And its intervention seems to be having some positive benefits. Tell me a bit more about that. Well, one example is the construction of four jigger factories that are being built in what's known as Battery Valley in northern France. And this stretches right down from the port of Dunkirk on the coast down to towns such as Dufres and Douai, which are in the old mining basin. And when these are fully operational, they will actually make France one of the biggest electric battery producers in Europe. And it was state handouts that helped persuade Prologium, which is a Taiwanese firm, to build their factory in Dunkirk. And as I said earlier, corporate investment is now pouring in. And this year, another 13 billion euros of investments were unveiled when the corporate titans turned up to be dined by President Macron in Versailles. And how about France's social support? Sophie, what's your read on that? Well, it's interesting because, of course, President Macron is accused by his detractors of dismantling the welfare state. And certainly, earlier this year, we had months of protests against his pension reform, which now requires the French to work until 64 to qualify for a state pension that's two years longer than they used to. But I think what's interesting is that you have, at the same time, a sort of soaring wealth of the billionaires and a flourishing of the French corporate sector, but you still have a functioning and relatively protective French welfare state. You have a number of measures that suggest that even though, obviously, inflation is squeezing everybody's budgets, you still have this welfare state that is managing to protect people from poverty at the bottom and the middle classes as well. In fact, despite Macron's reforms, the French state still takes more in taxes as a share of GDP than any other OECD country bar Denmark and still devotes more to social spending. Okay, but surely not everything is la vie en rose. No, of course not. I mean, France has definitely not got everything right. Far from it. There are genuine concerns about standards in schools, for example, replacement of teachers, access to healthcare. We saw with the riots in June that there are real worries about discrimination by the police. There's a sort of feeling of anxiety and politics is pretty polarized in France. And then there's also the problem of the stretched public finances in France as well, because all these subsidies come with a very high price tag. In fact, France hasn't balanced a government budget since before Emmanuel Macron was born. And yet, despite all of that, it does seem to be pretty resilient and pretty healthy. And as the French set off on their enviably long summer holidays, their model continues to do pretty well on the metrics that matter. Well, Sophie, I hope you manage to sneak a bit of a holiday for yourself. Thank you for coming on the show. Thanks very much, you too. If you were to go down to the forested slopes of the Cascade Mountains in West Washington State, you might in the past few decades have seen an interesting figure lurking around in the trees. Anne Rowe is The Economist's obituaries editor. He had a peaked cap like a wizard and a long flowing beard, white dreadlocks. He looked a bit like an escapee from a Tolkien film, possibly an elf or a wizard going about his business. He was not unwelcoming though, he would have either a big chainsaw or an enormous herbal palliative as he called it, like a cigar in his hand. And he would welcome you with open arms because this was Sainte-Rékely and where you were walking was his homestead as he called it, sometimes he called it the Magic Kingdom, where he had been building houses for the past several decades, extravagant extraordinary houses made out of anything the forest provided. Some of them multi-story with peaked flyaway roofs, extraordinary places, railings made of whole trees outside them. You would find little hermit's huts as he called them that were built on massive stumps of old growth cedar, which he reckoned were about a thousand years old. Then you would get a whole collection of circular yurts, which were used for yoga and putting up guests sometimes. He was always seeking to work with nature. He really didn't leave his compound very much, he had such fun there building all his extravagant creations. Still he was sought out by eco-architects across America who would come to look at his collection of buildings, the sky house, the garden house, all these buildings that seemed to grow out of nature and was sink back into it. In all he produced about 70 different buildings. His attitude to building was that it should be evolutionary. His motto was that we were all heading for the compost anyway, so that everything needed to change, you had to keep a completely flexible and open mind. He had been brought up on this property, his grandfather had had a cedar shake mill there, his father had worked in the mill and his options as he grew up were really to become a mechanic himself in the mill or to become a farmer like his parents to run cattle and keep pigs and chickens, but he didn't want to do anything like that. He tended much more towards art, so he went into it quite quickly after college, having been told that his designs were so fantastical that there was no point in commissioning a builder to do them, he'd have to get a hammer and do them himself. So he decided to do that and it was then in 1976 or so that he started the process of building. And he used two chief materials that he was deeply in love with, one was wood, especially cedar, the forests he lived in were of pine and cedar mostly. He loved the glow of the wood too, it was like the sun trapped inside it. And this was his favorite material of all, but he was also well aware that logging was going too far in Washington, so he tried to find other materials and the most useful stuff was called cob. And this was made of mud, sand, straw and water, you just put them all together in the right sort of proportions and stomp them round in a big trough, getting thoroughly covered with earth and straw and mud in the process. He usually went around covered in this stuff. It was enormous fun to do, it was usually done naked and he actually met his second wife while they were stomping cob together. And this was smeared on the outside of walls and it had a property that it would dry rather sculpturally and still be flexible and malleable. So he could work it with his hands and make fantastic sculptures on the outside of his buildings, flowers, dragons, all kinds of twisting plants and geometrical shapes. On one yurt he did enormous female genitalia, just for a joke. And he wanted all his buildings to sing and dance, he wanted to get a sense in them of the movement of life, the spirit of life as he thought of it. That was why everything flowed in his buildings, why the roofs appeared to fly away and the ridge timbers would be rounded rather than square. And the lintels and jams would flow away from doors and windows. Even the floors he'd make with a slightly different sort of cob which left them not absolutely flat but hummocky and smooth so you could dance on them. He liked to keep in mind the saying of the Native Americans who had lived in West Washington before him although they'd been coast dwellers and hadn't gone up to the mountain. As they had said that everyone had a song and once you found that song you never needed to ask for any other blessing because everything you needed would come to you. Anne Rowe on son Ray Kelly who has died aged 71. That's all for this episode of The Intelligence. The show's editors are Chris Impey and Jack Gill. Our deputy editor is John Joe Devlin and our sound engineer is Will Rowe with additional help this week from Johnny Allen. Our senior producers are Sam Westron and Rory Galloway. Our senior creative producer is William Warren. Our producers are Alize Jean-Baptiste, Kevin Caners, Barclay Brown and Sarah Larniuk with extra production help this week from Maggie Kadifa, Elna Schuetz and Benji Guy. We'll all see you back here on Monday. We all need to write for work, want to improve. Pulsed to your skills with Economist Education's six-week online course. You'll explore the craft of writing and learn from the Economist's editors how to engage and persuade. Whether it's vibrant memos, pithy social media posts or storytelling with data. And as a listener enjoy a 15% discount with the code WRITING. You can sign up now at Economist.com forward slash business writing. Hey, I'm Mark Robage and this is the Science of Scaling, a podcast about how to scale your revenue and sales. I'm talking with the folks who scaled the most successful sales teams in tech to give us the answers. They Kyle Parrish, the VP of Sales at Figma and Oliver J, the CRO at Asana and Kevin Egan, the Head of Sales at Alassian. So subscribe to the show now on Apple podcasts, Spotify and I guess literally everywhere else you listen to podcasts."}, "podcast_summary": "In the podcast episode, Mark Roberge discusses the topic of scaling revenue and sales with Kyle Parrish, Oliver J, and Kevin Egan, who have successfully scaled sales teams in the tech industry. They share insights and strategies for achieving growth and highlight the importance of building successful sales teams. Additionally, the episode mentions the quarterly results of tech giants such as Apple and Amazon, indicating signs of improvement amidst the challenges faced during the pandemic. The discussion also focuses on the growth challenges for big tech companies and specifically for Alphabet, highlighting the maturing digital advertising market and the need to adapt to changing search behaviors. The episode explores the potential of artificial intelligence and computing to drive future growth for tech companies. Despite the challenges, it is emphasized that France is experiencing unexpected economic vitality, defying perceptions created by strikes and protests. The country's economy has shown better performance compared to its European neighbors and has seen growth in sectors like luxury goods and technology. The report credits President Emmanuel Macron's pro-business initiatives and the country's embrace of state interventionism for its positive economic trajectory. However, challenges remain, including stretched public finances and concerns over education and social issues. Overall, the episode presents a nuanced view of the tech industry, the growth of big tech companies, and the economic state of France.", "podcast_guest": {"name": "Mark Roberge", "summary": "Page not found."}, "podcast_highlights": "- Alphabet's growth rate is slowing, creating challenges for sustaining future growth. The company's core businesses, such as digital advertising, are becoming more mature, limiting potential growth. \n- Alphabet is investing in AI technology to adapt to changes in user behavior and search patterns, but the monetization of AI-assisted search is still uncertain. \n- Alphabet's bets on new products and markets, including cloud computing, show potential for growth, but even these areas have limits to their growth. The long-term sustainability of Alphabet's high growth rate is in question."}